RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/drivers/fsl_caam.h
/*! @brief CAAM Private Blob. Used by caam_config_t. */
typedef enum _caam_priblob
{
    kCAAM_PrivSecureBootBlobs        = 0U, /*!< Private secure boot software blobs. */
    kCAAM_PrivProvisioningBlobsType1 = 1U, /*!< Private Provisioning Type 1 blobs. */
    kCAAM_PrivProvisioningBlobsType2 = 2U, /*!< Private Provisioning Type 2 blobs. */
    kCAAM_NormalOperationBlobs       = 3U, /*!< Normal operation blobs. */
} caam_priblob_t;

/*! @brief CAAM configuration structure. */
typedef struct _caam_config
{
    caam_job_ring_interface_t *jobRingInterface[4];
    caam_rng_sample_mode_t rngSampleMode;  /*!< RTMCTL Sample Mode. */
    caam_rng_ring_osc_div_t rngRingOscDiv; /*!< RTMCTL Oscillator Divide. */
    bool scfgrLockTrngProgramMode;         /*!< SCFGR Lock TRNG Program Mode. */
    bool scfgrEnableRandomDataBuffer;      /*!< SCFGR Enable random data buffer. */
    bool scfgrRandomRngStateHandle0;       /*!< SCFGR Random Number Generator State Handle 0. */
    bool scfgrRandomDpaResistance;         /*!< SCFGR Random Differential Power Analysis Resistance. */
    caam_priblob_t scfgrPriblob;           /*!< SCFGR Private Blob. */
} caam_config_t;

/*! @brief CAAM External Key Transfer command SRC (The source from which the key will be obtained) */
typedef enum _caam_ext_key_xfr_source
{
    kCAAM_ExtKeyXfr_KeyRegisterClass1 = 1U, /*!< The Class 1 Key Register is the source. */
    kCAAM_ExtKeyXfr_KeyRegisterClass2 = 2U, /*!< The Class 2 Key Register is the source. */
    kCAAM_ExtKeyXfr_PkhaRamE          = 3U, /*!< The PKHA E RAM is the source. */
} caam_ext_key_xfr_source_t;

typedef enum _caam_ecc_ecdsel
{
    kCAAM_ECDSEL_P_192           = 0x00u,
    kCAAM_ECDSEL_P_224           = 0x01u,
    kCAAM_ECDSEL_P_256           = 0x02u,
    kCAAM_ECDSEL_P_384           = 0x03u,
    kCAAM_ECDSEL_P_521           = 0x04u,
    kCAAM_ECDSEL_brainpoolP160r1 = 0x05u,
    kCAAM_ECDSEL_brainpoolP160t1 = 0x06u,
    kCAAM_ECDSEL_brainpoolP192r1 = 0x07u,
    kCAAM_ECDSEL_brainpoolP192t1 = 0x08u,
    kCAAM_ECDSEL_brainpoolP224r1 = 0x09u,
    kCAAM_ECDSEL_brainpoolP224t1 = 0x0Au,
    kCAAM_ECDSEL_brainpoolP256r1 = 0x0Bu,
    kCAAM_ECDSEL_brainpoolP256t1 = 0x0Cu,
    kCAAM_ECDSEL_brainpoolP320r1 = 0x0Du,
    kCAAM_ECDSEL_brainpoolP320t1 = 0x0Eu,
    kCAAM_ECDSEL_brainpoolP384r1 = 0x0Fu,
    kCAAM_ECDSEL_brainpoolP384t1 = 0x10u,
    kCAAM_ECDSEL_brainpoolP512r1 = 0x11u,
    kCAAM_ECDSEL_brainpoolP512t1 = 0x12u,
    kCAAM_ECDSEL_prime192v2      = 0x13u,
    kCAAM_ECDSEL_prime192v3      = 0x14u,
    kCAAM_ECDSEL_prime239v1      = 0x15u,
    kCAAM_ECDSEL_prime239v2      = 0x16u,
    kCAAM_ECDSEL_prime239v3      = 0x17u,
    kCAAM_ECDSEL_secp112r1       = 0x18u,
    kCAAM_ECDSEL_wtls8           = 0x19u,
    kCAAM_ECDSEL_wtls9           = 0x1Au,
    kCAAM_ECDSEL_secp160k1       = 0x1Bu,
    kCAAM_ECDSEL_secp160r1       = 0x1Cu,
    kCAAM_ECDSEL_secp160r2       = 0x1Du,
    kCAAM_ECDSEL_secp192k1       = 0x1Eu,
    kCAAM_ECDSEL_secp224k1       = 0x1Fu,
    kCAAM_ECDSEL_secp256k1       = 0x20u,
    kCAAM_ECDSEL_B_163           = 0x40u,
    kCAAM_ECDSEL_B_233           = 0x41u,
    kCAAM_ECDSEL_B_283           = 0x42u,
    kCAAM_ECDSEL_B_409           = 0x43u,
    kCAAM_ECDSEL_B_571           = 0x44u,
    kCAAM_ECDSEL_K_163           = 0x45u,
    kCAAM_ECDSEL_K_233           = 0x46u,
    kCAAM_ECDSEL_K_283           = 0x47u,
    kCAAM_ECDSEL_K_409           = 0x48u,
    kCAAM_ECDSEL_K_571           = 0x49u,
    kCAAM_ECDSEL_wtls1           = 0x4Au,
    kCAAM_ECDSEL_sect113r1       = 0x4Bu,
    kCAAM_ECDSEL_c2pnb163v1      = 0x4Cu,
    kCAAM_ECDSEL_c2pnb163v2      = 0x4Du,
    kCAAM_ECDSEL_c2pnb163v3      = 0x4Eu,
    kCAAM_ECDSEL_sect163r1       = 0x4Fu,
    kCAAM_ECDSEL_sect193r1       = 0x50u,
    kCAAM_ECDSEL_sect193r2       = 0x51u,
    kCAAM_ECDSEL_sect239k1       = 0x52u,
} caam_ecc_ecdsel_t;
/*! @} */ /* end of caam_driver */

/*******************************************************************************
 * AES Definitions
 *******************************************************************************/

/*!
 * @addtogroup caam_driver_aes
 * @{
 */

/*! AES block size in bytes */
#define CAAM_AES_BLOCK_SIZE 16

/*!
 *@}
 */ /* end of caam_driver_aes */

/*******************************************************************************
 * DES Definitions
 *******************************************************************************/
/*!
 * @addtogroup caam_driver_des
 * @{
 */

/*! @brief CAAM DES key size - 64 bits. */
#define CAAM_DES_KEY_SIZE 8U

/*! @brief CAAM DES IV size - 8 bytes */
#define CAAM_DES_IV_SIZE 8

/*! @brief CAAM blacken key size for ECB encryption */
#define CAAM_BLACKEN_ECB_SIZE(x) ((uint32_t)((x) + 15u) & ~15ul)

/*! @brief CAAM blacken key size for CCM encryption */
#define CAAM_BLACKEN_CCM_SIZE(x) (((uint32_t)((x) + 7u) & ~7ul) + 12u)

/*! @brief CAAM DSA public key length for EC domain */
#define CAAM_DSA_PUBLIC_KEY_LENGTH(domain)         \
    ((domain) == kCAAM_ECDSEL_P_192           ? 24u : \
     (domain) == kCAAM_ECDSEL_P_224           ? 28u : \
     (domain) == kCAAM_ECDSEL_P_256           ? 32u : \
     (domain) == kCAAM_ECDSEL_P_384           ? 48u : \
     (domain) == kCAAM_ECDSEL_P_521           ? 66u : \
     (domain) == kCAAM_ECDSEL_brainpoolP160r1 ? 20u : \
     (domain) == kCAAM_ECDSEL_brainpoolP160t1 ? 20u : \
     (domain) == kCAAM_ECDSEL_brainpoolP192r1 ? 24u : \
     (domain) == kCAAM_ECDSEL_brainpoolP192t1 ? 24u : \
     (domain) == kCAAM_ECDSEL_brainpoolP224r1 ? 28u : \
     (domain) == kCAAM_ECDSEL_brainpoolP224t1 ? 28u : \
     (domain) == kCAAM_ECDSEL_brainpoolP256r1 ? 32u : \
     (domain) == kCAAM_ECDSEL_brainpoolP256t1 ? 32u : \
     (domain) == kCAAM_ECDSEL_brainpoolP320r1 ? 40u : \
     (domain) == kCAAM_ECDSEL_brainpoolP320t1 ? 40u : \
     (domain) == kCAAM_ECDSEL_brainpoolP384r1 ? 48u : \
     (domain) == kCAAM_ECDSEL_brainpoolP384t1 ? 48u : \
     (domain) == kCAAM_ECDSEL_brainpoolP512r1 ? 64u : \
     (domain) == kCAAM_ECDSEL_brainpoolP512t1 ? 64u : \
     (domain) == kCAAM_ECDSEL_prime192v2      ? 24u : \
     (domain) == kCAAM_ECDSEL_prime192v3      ? 24u : \
     (domain) == kCAAM_ECDSEL_prime239v1      ? 30u : \
     (domain) == kCAAM_ECDSEL_prime239v2      ? 30u : \
     (domain) == kCAAM_ECDSEL_prime239v3      ? 30u : \
     (domain) == kCAAM_ECDSEL_secp112r1       ? 14u : \
     (domain) == kCAAM_ECDSEL_wtls8           ? 14u : \
     (domain) == kCAAM_ECDSEL_wtls9           ? 20u : \
     (domain) == kCAAM_ECDSEL_secp160k1       ? 20u : \
     (domain) == kCAAM_ECDSEL_secp160r1       ? 20u : \
     (domain) == kCAAM_ECDSEL_secp160r2       ? 20u : \
     (domain) == kCAAM_ECDSEL_secp192k1       ? 24u : \
     (domain) == kCAAM_ECDSEL_secp224k1       ? 28u : \
     (domain) == kCAAM_ECDSEL_secp256k1       ? 32u : \
     (domain) == kCAAM_ECDSEL_B_163           ? 21u : \
     (domain) == kCAAM_ECDSEL_B_233           ? 30u : \
     (domain) == kCAAM_ECDSEL_B_283           ? 36u : \
     (domain) == kCAAM_ECDSEL_B_409           ? 52u : \
     (domain) == kCAAM_ECDSEL_B_571           ? 72u : \
     (domain) == kCAAM_ECDSEL_K_163           ? 21u : \
     (domain) == kCAAM_ECDSEL_K_233           ? 30u : \
     (domain) == kCAAM_ECDSEL_K_283           ? 36u : \
     (domain) == kCAAM_ECDSEL_K_409           ? 52u : \
     (domain) == kCAAM_ECDSEL_K_571           ? 72u : \
     (domain) == kCAAM_ECDSEL_wtls1           ? 15u : \
     (domain) == kCAAM_ECDSEL_sect113r1       ? 15u : \
     (domain) == kCAAM_ECDSEL_c2pnb163v1      ? 21u : \
     (domain) == kCAAM_ECDSEL_c2pnb163v2      ? 21u : \
     (domain) == kCAAM_ECDSEL_c2pnb163v3      ? 21u : \
     (domain) == kCAAM_ECDSEL_sect163r1       ? 21u : \
     (domain) == kCAAM_ECDSEL_sect193r1       ? 25u : \
     (domain) == kCAAM_ECDSEL_sect193r2       ? 25u : \
     (domain) == kCAAM_ECDSEL_sect239k1       ? 25u : \
                                              0u)

/*! @brief CAAM ECC public key length for EC domain */
#define CAAM_ECC_PUBLIC_KEY_LENGTH(domain) (CAAM_DSA_PUBLIC_KEY_LENGTH(domain) * 2u)

/*! @brief CAAM ECC private key length for EC domain */
#define CAAM_ECC_PRIVATE_KEY_LENGTH(domain)        \
    ((domain) == kCAAM_ECDSEL_P_192           ? 24u : \
     (domain) == kCAAM_ECDSEL_P_224           ? 28u : \
     (domain) == kCAAM_ECDSEL_P_256           ? 32u : \
     (domain) == kCAAM_ECDSEL_P_384           ? 48u : \
     (domain) == kCAAM_ECDSEL_P_521           ? 66u : \
     (domain) == kCAAM_ECDSEL_brainpoolP160r1 ? 20u : \
     (domain) == kCAAM_ECDSEL_brainpoolP160t1 ? 20u : \
     (domain) == kCAAM_ECDSEL_brainpoolP192r1 ? 24u : \
     (domain) == kCAAM_ECDSEL_brainpoolP192t1 ? 24u : \
     (domain) == kCAAM_ECDSEL_brainpoolP224r1 ? 28u : \
     (domain) == kCAAM_ECDSEL_brainpoolP224t1 ? 28u : \
     (domain) == kCAAM_ECDSEL_brainpoolP256r1 ? 32u : \
     (domain) == kCAAM_ECDSEL_brainpoolP256t1 ? 32u : \
     (domain) == kCAAM_ECDSEL_brainpoolP320r1 ? 40u : \
     (domain) == kCAAM_ECDSEL_brainpoolP320t1 ? 40u : \
     (domain) == kCAAM_ECDSEL_brainpoolP384r1 ? 48u : \
     (domain) == kCAAM_ECDSEL_brainpoolP384t1 ? 48u : \
     (domain) == kCAAM_ECDSEL_brainpoolP512r1 ? 64u : \
     (domain) == kCAAM_ECDSEL_brainpoolP512t1 ? 64u : \
     (domain) == kCAAM_ECDSEL_prime192v2      ? 24u : \
     (domain) == kCAAM_ECDSEL_prime192v3      ? 24u : \
     (domain) == kCAAM_ECDSEL_prime239v1      ? 30u : \
     (domain) == kCAAM_ECDSEL_prime239v2      ? 30u : \
     (domain) == kCAAM_ECDSEL_prime239v3      ? 30u : \
     (domain) == kCAAM_ECDSEL_secp112r1       ? 14u : \
     (domain) == kCAAM_ECDSEL_wtls8           ? 15u : \
     (domain) == kCAAM_ECDSEL_wtls9           ? 21u : \
     (domain) == kCAAM_ECDSEL_secp160k1       ? 21u : \
     (domain) == kCAAM_ECDSEL_secp160r1       ? 21u : \
     (domain) == kCAAM_ECDSEL_secp160r2       ? 21u : \
     (domain) == kCAAM_ECDSEL_secp192k1       ? 24u : \
     (domain) == kCAAM_ECDSEL_secp224k1       ? 29u : \
     (domain) == kCAAM_ECDSEL_secp256k1       ? 32u : \
     (domain) == kCAAM_ECDSEL_B_163           ? 21u : \
     (domain) == kCAAM_ECDSEL_B_233           ? 30u : \
     (domain) == kCAAM_ECDSEL_B_283           ? 36u : \
     (domain) == kCAAM_ECDSEL_B_409           ? 52u : \
     (domain) == kCAAM_ECDSEL_B_571           ? 72u : \
     (domain) == kCAAM_ECDSEL_K_163           ? 21u : \
     (domain) == kCAAM_ECDSEL_K_233           ? 29u : \
     (domain) == kCAAM_ECDSEL_K_283           ? 36u : \
     (domain) == kCAAM_ECDSEL_K_409           ? 51u : \
     (domain) == kCAAM_ECDSEL_K_571           ? 72u : \
     (domain) == kCAAM_ECDSEL_wtls1           ? 14u : \
     (domain) == kCAAM_ECDSEL_sect113r1       ? 15u : \
     (domain) == kCAAM_ECDSEL_c2pnb163v1      ? 21u : \
     (domain) == kCAAM_ECDSEL_c2pnb163v2      ? 21u : \
     (domain) == kCAAM_ECDSEL_c2pnb163v3      ? 21u : \
     (domain) == kCAAM_ECDSEL_sect163r1       ? 21u : \
     (domain) == kCAAM_ECDSEL_sect193r1       ? 25u : \
     (domain) == kCAAM_ECDSEL_sect193r2       ? 25u : \
     (domain) == kCAAM_ECDSEL_sect239k1       ? 25u : \
                                              0u)

/*! @brief CAAM blacken key size for ECB encryption
 *
 * The second part of key size and buffer length needed for compution may differ.
 */
#define CAAM_ECC_SECOND_SIGN_BUFFER_SIZE(domain) ((CAAM_ECC_PRIVATE_KEY_LENGTH(domain) + 15u) & ~15u)

/*!
 *@}
 */ /* end of caam_driver_des */

