RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/drivers/fsl_caam.h
/*******************************************************************************
 * HASH Definitions
 ******************************************************************************/
/*!
 * @addtogroup caam_driver_hash
 * @{
 */

/*! @brief Supported cryptographic block cipher functions for HASH creation */
typedef enum _caam_hash_algo_t
{
    kCAAM_XcbcMac = 0, /*!< XCBC-MAC (AES engine) */
    kCAAM_Cmac,        /*!< CMAC (AES engine) */
    kCAAM_Sha1,        /*!< SHA_1   (MDHA engine)  */
    kCAAM_Sha224,      /*!< SHA_224 (MDHA engine)  */
    kCAAM_Sha256,      /*!< SHA_256 (MDHA engine)  */
    kCAAM_Sha384,      /*!< SHA_384 (MDHA engine)  */
    kCAAM_Sha512,      /*!< SHA_512 (MDHA engine)  */
    kCAAM_HmacSha1,    /*!< HMAC_SHA_1   (MDHA engine)  */
    kCAAM_HmacSha224,  /*!< HMAC_SHA_224 (MDHA engine)  */
    kCAAM_HmacSha256,  /*!< HMAC_SHA_256 (MDHA engine)  */
    kCAAM_HmacSha384,  /*!< HMAC_SHA_384 (MDHA engine)  */
    kCAAM_HmacSha512,  /*!< HMAC_SHA_512 (MDHA engine)  */
} caam_hash_algo_t;

/*! @brief CAAM HASH Context size. */
#define CAAM_SHA_BLOCK_SIZE  128U                /*!< up to SHA-512 block size  */
#define CAAM_HASH_BLOCK_SIZE CAAM_SHA_BLOCK_SIZE /*!< CAAM hash block size  */

/*! @brief CAAM HASH Context size. */
#define CAAM_HASH_CTX_SIZE 83

/*! @brief Storage type used to save hash context. */
typedef uint32_t caam_hash_ctx_t[CAAM_HASH_CTX_SIZE];

/*!
 *@}
 */ /* end of caam_driver_hash */

/*******************************************************************************
 * CRC Definitions
 ******************************************************************************/
/*! @brief Supported CRC modes */
typedef enum _caam_crc_algo_t
{
    kCAAM_CrcIEEE,     /*!< IEE 802 CRC32 (CRCA engine)  */
    kCAAM_CrciSCSI,    /*!< iSCSI CRC32 (CRCA engine)  */
    kCAAM_CrcCUSTPOLY, /*!< Custom polynomial mode (CRCA engine)  */
} caam_crc_algo_t;

/*! @brief CAAM AAI CRC modes*/
typedef enum _caam_aai_crc_alg
{
    kCAAM_CRC_ModeIEEE802  = 0x01U << 4, /* IEE 802 mode */
    kCAAM_CRC_ModeIETF3385 = 0x02U << 4, /* iSCSI mode */
    kCAAM_CRC_ModeCUSTPOLY =
        0x04U << 4, /* Custom polynomial programmed into Key register. Can be 1-32bits. Must be left justified */
    kCAAM_CRC_ModeDefault = 0x0U << 4, /* Input data is bit-swapped, Out data is bit and byte swapped and complemented
                                          and init value is FFFFFFFFh*/
    kCAAM_CRC_ModeDIS = 0x10U << 4,    /* Turn off input bit-swapping */
    kCAAM_CRC_ModeDOS = 0x20U << 4,    /* Turn off output bit-swapping */
    kCAAM_CRC_ModeDOC = 0x40U << 4,    /* Turn of complementing CRC output data*/
    kCAAM_CRC_ModeIVZ = 0x80U << 4,    /* Initial value is zero */
} caam_aai_crc_alg_t;

/*! @brief Storage type used to save crc context. */
#define caam_crc_ctx_t caam_hash_ctx_t

/*******************************************************************************
 * RNG Definitions
 ******************************************************************************/
/*!
 * @addtogroup caam_driver_rng
 * @{
 */

/*! @brief CAAM RNG state handle */
typedef enum _caam_rng_state_handle
{
    kCAAM_RngStateHandle0 = 0u, /*!< CAAM RNG state handle 0 */
    kCAAM_RngStateHandle1 = 1u, /*!< CAAM RNG state handle 1 */
} caam_rng_state_handle_t;

/*! @brief Type of random data to generate */
typedef enum _caam_rng_random_type
{
    kCAAM_RngDataAny       = 0u, /*!< CAAM RNG any random data bytes */
    kCAAM_RngDataOddParity = 1u, /*!< CAAM RNG odd parity random data bytes */
    kCAAM_RngDataNonZero   = 2u, /*!< CAAM RNG non zero random data bytes */
} caam_rng_random_type_t;

/*! @brief 256-bit value used as optional additional entropy input */
typedef uint32_t caam_rng_generic256_t[256 / sizeof(uint32_t)];

/*! @brief CAAM RNG configuration */
typedef struct _caam_rng_user_config
{
    uint32_t autoReseedInterval; /*!< Automatic reseed internal. If set to zero, CAAM RNG will use hardware default
                                      interval of 10.000.000 generate requests. */
    caam_rng_generic256_t *personalString; /*!< NULL or pointer to optional personalization string */
} caam_rng_config_t;

/*!
 *@}
 */ /* end of caam_driver_rng */

/*******************************************************************************
 * BLLOBS Definitions
 ******************************************************************************/
/*!
 * @addtogroup caam_driver_blob
 * @{
 */

/*! @brief CAAM FIFOST types. */
typedef enum _caam_fifost_type
{
    kCAAM_FIFOST_Type_Ecb_Jkek = 0x24u, /*!< Key Register, encrypted using AES-ECB with the job
descriptor key encryption key. */
    kCAAM_FIFOST_Type_Ecb_Tkek = 0x25u, /*!< Key Register, encrypted using AES-ECB with the
trusted descriptor key encryption key. */
    kCAAM_FIFOST_Type_Ccm_Jkek = 0x14u, /*!< Key Register, encrypted using AES-CCM with the
job descriptor key encryption key. */
    kCAAM_FIFOST_Type_Ccm_Tkek = 0x15u, /*!< Key register, encrypted using AES-CCM with the
trusted descriptor key encryption key. */
} caam_fifost_type_t;

/*! @brief CAAM descriptor types. */
typedef enum _caam_desc_type
{
    kCAAM_Descriptor_Type_Ecb_Jkek = 0x0u, /*!< Key Register, encrypted using AES-ECB with the job
descriptor key encryption key. */
    kCAAM_Descriptor_Type_Ecb_Tkek = 0x2u, /*!< Key Register, encrypted using AES-ECB with the
trusted descriptor key encryption key. */
    kCAAM_Descriptor_Type_Ccm_Jkek = 0x1u, /*!< Key Register, encrypted using AES-CCM with the
job descriptor key encryption key. */
    kCAAM_Descriptor_Type_Ccm_Tkek = 0x3u, /*!< Key register, encrypted using AES-CCM with the
trusted descriptor key encryption key. */
} caam_desc_type_t;

/*! @brief CAAM key types. */
typedef enum _caam_key_type
{
    kCAAM_Key_Type_None     = 0x0ul,
    kCAAM_Key_Type_Ecb_Jkek = 0x80ul << 15, /*!< Key Register, encrypted using AES-ECB with the job
  descriptor key encryption key. */
    kCAAM_Key_Type_Ecb_Tkek = 0x81ul << 15, /*!< Key Register, encrypted using AES-ECB with the
  trusted descriptor key encryption key. */
    kCAAM_Key_Type_Ccm_Jkek = 0xA0ul << 15, /*!< Key Register, encrypted using AES-CCM with the
job descriptor key encryption key. */
    kCAAM_Key_Type_Ccm_Tkek = 0xA1ul << 15, /*!< Key register, encrypted using AES-CCM with the
trusted descriptor key encryption key. */
} caam_key_type_t;

/*! @brief CAAM ecc encryption types. */
typedef enum _caam_ecc_encryption_type
{
    kCAAM_Ecc_Encryption_Type_None     = 0x0u,
    kCAAM_Ecc_Encryption_Type_Ecb_Jkek = 0x1u << 2, /*!< Key Register, encrypted using AES-ECB with the job
        descriptor key encryption key. */
    kCAAM_Ecc_Encryption_Type_Ccm_Jkek = 0x5u << 2, /*!< Key Register, encrypted using AES-CCM with the
    job descriptor key encryption key. */
} caam_ecc_encryption_type_t;

/*! @brief CAAM rsa key encryption types. */
typedef enum _caam_rsa_key_type
{
    kCAAM_Rsa_Key_Type_None     = 0x0u,
    kCAAM_Rsa_Key_Type_Ecb_Jkek = 0x4u << 4, /*!< Key Register, encrypted using AES-ECB with the job
        descriptor key encryption key. */
    kCAAM_Rsa_Key_Type_Ccm_Jkek = 0x5u << 4, /*!< Key Register, encrypted using AES-CCM with the
    job descriptor key encryption key. */
} caam_rsa_key_type_t;

