RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/drivers/fsl_caam.h
/*******************************************************************************
 * HMAC API
 ******************************************************************************/

/*!
 * @addtogroup caam_driver_hmac
 * @{
 */
/*!
 * @brief Initialize HMAC context
 *
 * This function initializes the HMAC.
 *
 * For XCBC-MAC, the key length must be 16. For CMAC, the key length can be
 * the AES key lengths supported by AES engine. For MDHA the key length argument
 * is ignored.
 *
 * This functions is used to initialize the context for both blocking and non-blocking
 * CAAM_HMAC API.
 *
 * @param base CAAM peripheral base address
 * @param handle Handle used for this request.
 * @param[out] ctx Output HMAC context
 * @param algo Underlaying algorithm to use for HMAC computation.
 * @param key Input key
 * @param keySize Size of input key in bytes
 * @return Status of initialization
 */
status_t CAAM_HMAC_Init(CAAM_Type *base,
                        caam_handle_t *handle,
                        caam_hash_ctx_t *ctx,
                        caam_hash_algo_t algo,
                        const uint8_t *key,
                        size_t keySize);

/*!
 * @brief Create Message Authentication Code (MAC) on given data
 *
 * Perform the full keyed XCBC-MAC/CMAC, or HMAC-SHA in one function call.
 *
 * Key shall be supplied if the underlaying algoritm is AES XCBC-MAC, CMAC, or SHA HMAC.
 *
 * For XCBC-MAC, the key length must be 16. For CMAC, the key length can be
 * the AES key lengths supported by AES engine. For HMAC, the key can have
 * any size.
 *
 * \param base CAAM peripheral base address
 * \param handle Handle used for this request.
 * \param algo Underlaying algorithm to use for MAC computation.
 * \param input Input data
 * \param inputSize Size of input data in bytes
 * \param key Input key
 * \param keySize Size of input key in bytes
 * \param[out] output Output MAC data
 * \param[out] outputSize Output parameter storing the size of the output MAC in bytes
 * \return Status of the one call hash operation.
 */
status_t CAAM_HMAC(CAAM_Type *base,
                   caam_handle_t *handle,
                   caam_hash_algo_t algo,
                   const uint8_t *input,
                   size_t inputSize,
                   const uint8_t *key,
                   size_t keySize,
                   uint8_t *output,
                   size_t *outputSize);
/*!
 *@}
 */ /* end of caam_driver_hmac */

/*!
 * @addtogroup caam_nonblocking_driver_hmac
 * @{
 */
/*!
 * @brief Create Message Authentication Code (MAC) on given data
 *
 * Perform the full keyed XCBC-MAC/CMAC, or HMAC-SHA in one function call.
 *
 * Key shall be supplied if the underlaying algoritm is AES XCBC-MAC, CMAC, or SHA HMAC.
 *
 * For XCBC-MAC, the key length must be 16. For CMAC, the key length can be
 * the AES key lengths supported by AES engine. For HMAC, the key can have
 * any size, however the function will block if the supplied key is bigger than
 * the block size of the underlying hashing algorithm (e.g. >64 bytes for SHA256).
 *
 * The function is not blocking with the exception of supplying large key sizes.
 * In that case the function will block until the large key is hashed down with the
 * supplied hashing algorithm (as per FIPS 198-1), after which operation is resumed
 * to calling non-blocking HMAC.
 *
 * \param base CAAM peripheral base address
 * \param handle Handle used for this request.
 * @param[out] descriptor Memory for the CAAM descriptor.
 * \param algo Underlaying algorithm to use for MAC computation.
 * \param input Input data
 * \param inputSize Size of input data in bytes
 * \param key Input key
 * \param keySize Size of input key in bytes
 * \param[out] output Output MAC data
 * \param[out] outputSize Output parameter storing the size of the output MAC in bytes
 * \return Status of the one call hash operation.
 */
status_t CAAM_HMAC_NonBlocking(CAAM_Type *base,
                               caam_handle_t *handle,
                               caam_desc_hash_t descriptor,
                               caam_hash_algo_t algo,
                               const uint8_t *input,
                               size_t inputSize,
                               const uint8_t *key,
                               size_t keySize,
                               uint8_t *output,
                               size_t *outputSize);
/*!
 *@}
 */ /* end of caam_nonblocking_driver_hmac */

/*******************************************************************************
 * CRC API
 ******************************************************************************/

/*!
 * @addtogroup caam_driver_crc
 * @{
 */
/*!
 * @brief Initialize CRC context
 *
 * This function initializes the CRC context.
 * polynomial shall be supplied if the underlaying algoritm is kCAAM_CrcCUSTPOLY.
 * polynomial shall be NULL if the underlaying algoritm is kCAAM_CrcIEEE or kCAAM_CrciSCSI.
 *
 * This functions is used to initialize the context for CAAM_CRC API
 *
 * @param base CAAM peripheral base address
 * @param handle Handle used for this request.
 * @param[out] ctx Output crc context
 * @param algo Underlaying algorithm to use for CRC computation
 * @param polynomial CRC polynomial (NULL if underlaying algorithm is kCAAM_CrcIEEE or kCAAM_CrciSCSI)
 * @param polynomialSize Size of polynomial in bytes (0u if underlaying algorithm is kCAAM_CrcIEEE or kCAAM_CrciSCSI)
 * @param mode Specify how CRC engine manipulates its input and output data
 * @return Status of initialization
 */
status_t CAAM_CRC_Init(CAAM_Type *base,
                       caam_handle_t *handle,
                       caam_crc_ctx_t *ctx,
                       caam_crc_algo_t algo,
                       const uint8_t *polynomial,
                       size_t polynomialSize,
                       caam_aai_crc_alg_t mode);

/*!
 * @brief Add data to current CRC
 *
 * Add data to current CRC. This can be called repeatedly. The functions blocks. If it returns kStatus_Success, the
 * running CRC has been updated (CAAM has processed the input data), so the memory at input pointer can be released back
 * to system. The context is updated with the running CRC and with all necessary information to support possible context
 * switch.
 *
 * @param[in,out] ctx CRC context
 * @param input Input data
 * @param inputSize Size of input data in bytes
 * @return Status of the crc update operation
 */
status_t CAAM_CRC_Update(caam_crc_ctx_t *ctx, const uint8_t *input, size_t inputSize);

/*!
 * @brief Finalize CRC
 *
 * Outputs the final CRC (computed by CAAM_CRC_Update()) and erases the context.
 *
 * @param[in,out] ctx Input crc context
 * @param[out] output Output crc data
 * @param[out] outputSize Output parameter storing the size of the output crc in bytes
 * @return Status of the crc finish operation
 */
status_t CAAM_CRC_Finish(caam_crc_ctx_t *ctx, uint8_t *output, size_t *outputSize);

/*!
 * @brief Create CRC on given data
 *
 * Perform CRC in one function call.
 *
 * Polynomial shall be supplied if underlaying algorithm is kCAAM_CrcCUSTPOLY.
 * Polynomial shall be NULL if underlaying algorithm is kCAAM_CrcIEEE or kCAAM_CrciSCSI.
 *
 *
 * The function is blocking.
 *
 * @param base CAAM peripheral base address
 * @param handle Handle used for this request.
 * @param algo Underlaying algorithm to use for crc computation.
 * @param mode Specify how CRC engine manipulates its input and output data.
 * @param input Input data
 * @param inputSize Size of input data in bytes
 * @param polynomial CRC polynomial (NULL if underlaying algorithm is kCAAM_CrcIEEE or kCAAM_CrciSCSI)
 * @param polynomialSize Size of input polynomial in bytes (0U if underlaying algorithm is kCAAM_CrcIEEE or
 * kCAAM_CrciSCSI)
 * @param[out] output Output crc data
 * @param[out] outputSize Output parameter storing the size of the output crc in bytes
 * @return Status of the one call crc operation.
 */
status_t CAAM_CRC(CAAM_Type *base,
                  caam_handle_t *handle,
                  caam_crc_algo_t algo,
                  caam_aai_crc_alg_t mode,
                  const uint8_t *input,
                  size_t inputSize,
                  const uint8_t *polynomial,
                  size_t polynomialSize,
                  uint8_t *output,
                  size_t *outputSize);

/*!
 * @brief Create CRC on given data
 *
 * Perform CRC in one function call.
 *
 * Polynomial shall be supplied if underlaying algorithm is kCAAM_CrcCUSTPOLY.
 * Polynomial shall be NULL if underlaying algorithm is kCAAM_CrcIEEE or kCAAM_CrciSCSI.
 *
 * The function is non-blocking. The request is scheduled at CAAM.
 *
 * @param base CAAM peripheral base address
 * @param handle Handle used for this request.
 * @param[out] descriptor Memory for the CAAM descriptor.
 * @param algo Underlaying algorithm to use for crc computation.
 * @param mode Specify how CRC engine manipulates its input and output data.
 * @param input Input data
 * @param inputSize Size of input data in bytes
 * @param polynomial CRC polynomial (NULL if underlaying algorithm is kCAAM_CrcIEEE or kCAAM_CrciSCSI)
 * @param polynomialSize Size of input polynomial in bytes (0U if underlaying algorithm is kCAAM_CrcIEEE or
 * kCAAM_CrciSCSI)
 * @param[out] output Output crc data
 * @param[out] outputSize Output parameter storing the size of the output crc in bytes
 * @return Status of the one call crc operation.
 */
status_t CAAM_CRC_NonBlocking(CAAM_Type *base,
                              caam_handle_t *handle,
                              caam_desc_hash_t descriptor,
                              caam_crc_algo_t algo,
                              caam_aai_crc_alg_t mode,
                              const uint8_t *input,
                              size_t inputSize,
                              const uint8_t *polynomial,
                              size_t polynomialSize,
                              uint8_t *output,
                              size_t *outputSize);

/*!
 *@}
 */ /* end of caam_driver_crc */
/*******************************************************************************
 * RNG API
 ******************************************************************************/

/*!
 * @addtogroup caam_driver_rng
 * @{
 */

/*!
 * @brief Initializes user configuration structure to default.
 *
 * This function initializes the configure structure to default value. the default
 * value are:
 * @code
 *     config->autoReseedInterval = 0;
 *     config->personalString = NULL;
 * @endcode
 *
 * @param config   User configuration structure.
 * @return status of the request
 */
status_t CAAM_RNG_GetDefaultConfig(caam_rng_config_t *config);

/*!
 * @brief Instantiate the CAAM RNG state handle
 *
 * This function instantiates CAAM RNG state handle.
 * The function is blocking and returns after CAAM has processed the request.
 *
 * @param base CAAM peripheral base address
 * @param handle CAAM jobRing used for this request
 * @param stateHandle RNG state handle to instantiate
 * @param config Pointer to configuration structure.
 * @return Status of the request
 */
status_t CAAM_RNG_Init(CAAM_Type *base,
                       caam_handle_t *handle,
                       caam_rng_state_handle_t stateHandle,
                       const caam_rng_config_t *config);

/*!
 * @brief Uninstantiate the CAAM RNG state handle
 *
 * This function uninstantiates CAAM RNG state handle.
 * The function is blocking and returns after CAAM has processed the request.
 *
 * @param base CAAM peripheral base address
 * @param handle jobRing used for this request.
 * @param stateHandle RNG state handle to uninstantiate
 * @return Status of the request
 */
status_t CAAM_RNG_Deinit(CAAM_Type *base, caam_handle_t *handle, caam_rng_state_handle_t stateHandle);

/*!
 * @brief Generate Secure Key
 *
 * This function generates random data writes it to Secure Key registers.
 * The function is blocking and returns after CAAM has processed the request.
 * RNG state handle 0 is always used.
 *
 * @param base CAAM peripheral base address
 * @param handle jobRing used for this request
 * @param additionalEntropy NULL or Pointer to optional 256-bit additional entropy.
 * @return Status of the request
 */
status_t CAAM_RNG_GenerateSecureKey(CAAM_Type *base, caam_handle_t *handle, caam_rng_generic256_t additionalEntropy);

/*!
 * @brief Reseed the CAAM RNG state handle
 *
 * This function reseeds the CAAM RNG state handle.
 * For a state handle in nondeterministic mode, the DRNG is seeded with 384 bits of
 * entropy from the TRNG and an optional 256-bit additional input from the descriptor
 * via the Class 1 Context Register.
 *
 * The function is blocking and returns after CAAM has processed the request.
 *
 * @param base CAAM peripheral base address
 * @param handle jobRing used for this request
 * @param stateHandle RNG state handle to reseed
 * @param additionalEntropy NULL or Pointer to optional 256-bit additional entropy.
 * @return Status of the request
 */
status_t CAAM_RNG_Reseed(CAAM_Type *base,
                         caam_handle_t *handle,
                         caam_rng_state_handle_t stateHandle,
                         caam_rng_generic256_t additionalEntropy);

/*!
 * @brief Get random data
 *
 * This function gets random data from CAAM RNG.
 *
 * The function is blocking and returns after CAAM has generated the requested data or an error occurred.
 *
 * @param base CAAM peripheral base address
 * @param handle jobRing used for this request
 * @param stateHandle RNG state handle used to generate random data
 * @param[out] data Pointer address used to store random data
 * @param dataSize Size of the buffer pointed by the data parameter
 * @param dataType Type of random data to be generated
 * @param additionalEntropy NULL or Pointer to optional 256-bit additional entropy.
 * @return Status of the request
 */
status_t CAAM_RNG_GetRandomData(CAAM_Type *base,
                                caam_handle_t *handle,
                                caam_rng_state_handle_t stateHandle,
                                uint8_t *data,
                                size_t dataSize,
                                caam_rng_random_type_t dataType,
                                caam_rng_generic256_t additionalEntropy);

/*!
 *@}
 */ /* end of caam_driver_rng */

/*!
 * @addtogroup caam_nonblocking_driver_rng
 * @{
 */

/*!
 * @brief Request random data
 *
 * This function schedules the request for random data from CAAM RNG.
 * Memory at memory pointers will be accessed by CAAM shortly after this function
 * returns, according to actual CAAM schedule.
 *
 * @param base CAAM peripheral base address
 * @param handle RNG handle used for this request
 * @param stateHandle RNG state handle used to generate random data
 * @param[out] descriptor memory for CAAM commands
 * @param[out] data Pointer address used to store random data
 * @param dataSize Size of the buffer pointed by the data parameter, in bytes.
 * @param dataType Type of random data to be generated.
 * @param additionalEntropy NULL or Pointer to optional 256-bit additional entropy.
 * @return status of the request
 */
status_t CAAM_RNG_GetRandomDataNonBlocking(CAAM_Type *base,
                                           caam_handle_t *handle,
                                           caam_rng_state_handle_t stateHandle,
                                           caam_desc_rng_t descriptor,
                                           void *data,
                                           size_t dataSize,
                                           caam_rng_random_type_t dataType,
                                           caam_rng_generic256_t additionalEntropy);

/*!
 *@}
 */ /* end of caam_nonblocking_driver_rng */

