RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/drivers/fsl_caam.h
/*******************************************************************************
 * ECC
 ******************************************************************************/

/*!
 * @addtogroup caam_driver_ecc
 * @{
 */

/*!
 * @brief Return size of private key based on encryption type and ecliptic curve domain
 *
 * @param encryptKeyType Type of key encryption.
 * @param ecdsel Elliptic curve domain selection
 *
 * @return size_t Size of private key.
 */
size_t CAAM_ECC_PrivateKeySize(caam_ecc_encryption_type_t encryptKeyType, caam_ecc_ecdsel_t ecdsel);

/*!
 * @brief Generates public and private key for ECC.
 *
 * The buffer size of privKey can be determined using CAAM_ECC_PRIVATE_KEY_LENGTH.
 * The buffer size of pubKey can be determined using CAAM_ECC_PUBLIC_KEY_LENGTH.
 * For encrypted privKey, the buffer size can be determined using CAAM_BLACKEN_ECB_SIZE
 * or CAAM_BLACKEN_CCM_SIZE macros.
 *
 * @param base CAAM peripheral base address
 * @param handle Handle used for this request. Specifies jobRing.
 * @param ecdsel Elliptic curve domain selection
 * @param encryptKeyType Type of key encryption
 * @param[out] privKey Private key
 * @param[out] pubKey Public key
 * @return Operation status.
 */
status_t CAAM_ECC_KeyPair(CAAM_Type *base,
                          caam_handle_t *handle,
                          caam_ecc_ecdsel_t ecdsel,
                          caam_ecc_encryption_type_t encryptKeyType,
                          uint8_t *privKey,
                          uint8_t *pubKey);

/*!
 * @brief Generates signature using ECC.
 *
 * The buffer size of signFirst can be determined using CAAM_ECC_PRIVATE_KEY_LENGTH.
 * ! The buffer size of signSecond can be determined using CAAM_ECC_SECOND_SIGN_BUFFER_SIZE.
 *
 * @param base CAAM peripheral base address
 * @param handle Handle used for this request. Specifies jobRing.
 * @param privKey Private key
 * @param data Hashed data
 * @param dataSize Hashed data length
 * @param ecdsel Elliptic curve domain selection
 * @param encryptKeyType Type of key encryption
 * @param[out] signFirst First part of the signature
 * @param[out] signSecond Second part of the signature
 * @return Operation status.
 */
status_t CAAM_ECC_Sign(CAAM_Type *base,
                       caam_handle_t *handle,
                       const uint8_t *privKey,
                       const uint8_t *data,
                       size_t dataSize,
                       caam_ecc_ecdsel_t ecdsel,
                       caam_ecc_encryption_type_t encryptKeyType,
                       uint8_t *signFirst,
                       uint8_t *signSecond);

/*!
 * @brief Verify ECC signature using public key
 *
 * The buffer size of tmp can be determined using CAAM_ECC_PUBLIC_KEY_LENGTH.
 *
 * @param base CAAM peripheral base address
 * @param handle Handle used for this request. Specifies jobRing.
 * @param pubKey Public key
 * @param data Hashed data
 * @param dataSize Hashed data length
 * @param signFirst First part of the signature
 * @param signSecond Second part of the signature
 * @param ecdsel Elliptic curve domain selection
 * @param[in,out] tmp Temporary storage for intermediate results
 * @return Operation status.
 */
status_t CAAM_ECC_VerifyPublicKey(CAAM_Type *base,
                                  caam_handle_t *handle,
                                  const uint8_t *pubKey,
                                  const uint8_t *data,
                                  size_t dataSize,
                                  const uint8_t *signFirst,
                                  const uint8_t *signSecond,
                                  caam_ecc_ecdsel_t ecdsel,
                                  uint8_t *tmp);

/*!
 * @brief Verify ECC signature using private key
 *
 * Faster that verifying using public key.
 *
 * @param base CAAM peripheral base address
 * @param handle Handle used for this request. Specifies jobRing.
 * @param privKey Private key
 * @param data Hashed data
 * @param dataSize Hashed data length
 * @param signFirst First part of the signature
 * @param signSecond Second part of the signature
 * @param ecdsel Elliptic curve domain selection
 * @param encryptKeyType Type of key encryption
 * @return Operation status.
 */
status_t CAAM_ECC_VerifyPrivateKey(CAAM_Type *base,
                                   caam_handle_t *handle,
                                   const uint8_t *privKey,
                                   const uint8_t *data,
                                   size_t dataSize,
                                   const uint8_t *signFirst,
                                   const uint8_t *signSecond,
                                   caam_ecc_ecdsel_t ecdsel,
                                   caam_ecc_encryption_type_t encryptKeyType);
/*!
 *@}
 */ /* end of caam_driver_ecc */

/*******************************************************************************
 * RSA
 ******************************************************************************/

/*!
 * @addtogroup caam_driver_rsa
 * @{
 */

/*!
 * @brief Return size for private key buffer based on encryption type and ecliptic curve domain
 *
 * @param prvKeyType Type of private key
 * @param privExponentSize Expected length of private exponent without encryption padding.
 *
 * @return size_t Size for private key buffer.
 */
size_t CAAM_RSA_PrivateExponentSize(caam_rsa_key_type_t prvKeyType, uint32_t privExponentSize);

/*!
 * @brief Generates RSA key.
 *
 * Generates modulus N and private exponent D give prime numbers P and Q and public exponent E.
 * Public key is {E,N}. Private key is {D,N}.
 *
 * ! privExponentSize value may differ for different P abd Q with same bit length.
 * For encrypted privExponent, the buffer size can be determined using CAAM_BLACKEN_ECB_SIZE
 * or CAAM_BLACKEN_CCM_SIZE macros.
 *
 * @param base CAAM peripheral base address
 * @param handle Handle used for this request. Specifies jobRing.
 * @param primeP Prime number P
 * @param primeQ Prime number Q
 * @param primesSize Byte length of primeP or primeQ (primeP and primeQ must have the same byte length)
 * @param pubExponent Public exponent E
 * @param pubExponentSize  Byte length of pubExponent
 * @param prvKeyType Type of private key
 * @param[out] modulus Buffer for calculated modulus N
 * @param modulusSize Byte length of modulus buffer
 * @param[out] privExponent Buffer for calculated private exponent D
 * @param[out] privExponentSize Byte length of calculated private exponent.
 * @return Operation status.
 */
status_t CAAM_RSA_KeyPair(CAAM_Type *base,
                          caam_handle_t *handle,
                          const uint8_t *primeP,
                          const uint8_t *primeQ,
                          uint32_t primesSize,
                          const uint8_t *pubExponent,
                          uint32_t pubExponentSize,
                          caam_rsa_key_type_t prvKeyType,
                          uint8_t *modulus,
                          uint32_t modulusSize,
                          uint8_t *privExponent,
                          size_t *privExponentSize);

/*!
 * @brief Performs the RSA public key primitive.
 *
 * Performs the RSA public key primitive which can be used when encrypting a secret or verifying a signature.
 *
 * @param base CAAM peripheral base address
 * @param handle Handle used for this request. Specifies jobRing.
 * @param plainText Input data
 * @param plainTextize Byte length of the input data
 * @param modulus Modulus N
 * @param modulusSize Byte length of modulus
 * @param pubExponent Public exponent E
 * @param pubExponentSize  Byte length of pubExponent
 * @param dataOutType Type of encryption of output data
 * @param[out] cipherText Buffer for RSA encrypted data
 * @return Operation status
 */
status_t CAAM_RSA_Encrypt(CAAM_Type *base,
                          caam_handle_t *handle,
                          const uint8_t *plainText,
                          uint32_t plainTextSize,
                          const uint8_t *modulus,
                          uint32_t modulusSize,
                          const uint8_t *pubExponent,
                          uint32_t pubExponentSize,
                          caam_rsa_encryption_type_t dataOutType,
                          caam_rsa_format_type_t format,
                          uint8_t *cipherText);

/*!
 * @brief Performs the RSA private key primitive.
 *
 * Performs the RSA private key primitive which can be used when decrypting a secret or creating a siganture.
 *
 * @param base CAAM peripheral base address
 * @param handle Handle used for this request. Specifies jobRing.
 * @param cipherText Input data
 * @param modulus Moulus N
 * @param modulusSize Byte length of modulus
 * @param privExponent Private exponent D
 * @param privExponentSize Byte length of privExponent
 * @param prvKeyType Type of private key encryption
 * @param dataOutType Type of encryption of output data
 * @param[out] plainText Buffer for RSA encrypted data
 * @param[out] rsaDecSize Returned output size
 * @return Operation status
 */
status_t CAAM_RSA_Decrypt(CAAM_Type *base,
                          caam_handle_t *handle,
                          const uint8_t *cipherText,
                          const uint8_t *modulus,
                          uint32_t modulusSize,
                          const uint8_t *privExponent,
                          uint32_t privExponentSize,
                          caam_rsa_encryption_type_t prvKeyType,
                          caam_rsa_encryption_type_t dataOutType,
                          caam_rsa_format_type_t format,
                          uint8_t *plainText,
                          size_t *rsaDecSize);

/*!
 *@}
 */ /* end of caam_driver_rsa */

#if defined(__cplusplus)
}
#endif

#endif /* FSL_CAAM_H_ */